<a href="https://colab.research.google.com/github/DAVIDnHANG/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment_TurnIn2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [4]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-10 18:57:04--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.229.229
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.229.229|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  26.7MB/s    in 7.8s

2019-09-10 18:57:12 (25.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [5]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [6]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [7]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

In [0]:
#gotta DF all the files.
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
products = pd.read_csv('products.csv')
order_products__train = pd.read_csv('order_products__train.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
orders = pd.read_csv('orders.csv')

In [0]:

#concat order product Prior and Train
order_products = pd.concat([order_products__prior, order_products__train])

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:

#what are the files I wants? I want product, and orders, 
#i think i want to merge product ID to order_id, to count how many times each was ordered. so combined Order, Product, and order_product_pair to combined Product ID and Order ID column
#commands to start merging three different DF together...

#i made this code to organize the product name's rows. 

#I want products name only with these items
condition = (products['product_name']=='Banana') | (products['product_name']=='Bag of Organic Bananas') |  (products['product_name']=='Organic Strawberries') | (products['product_name']=='Organic Baby Spinach') |(products['product_name']=='Organic Hass Avocado') |(products['product_name']=='Organic Avocado') |(products['product_name']=='Large Lemon')|(products['product_name']=='Strawberries')|(products['product_name']=='Limes')|(products['product_name']=='Organic Whole Milk')
#what columns I want to show from FILE Product
column_product = ['product_id','product_name']
#let combined "the products with name" and "which column" together
Subset_Product_ID = products.loc[condition,column_product]
Subset_Product_ID.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [0]:
merging_Product_ID=pd.merge(Subset_Product_ID, order_products, how='inner',on='product_id')
merging_Product_ID.head(3)

   product_id            product_name  order_id  add_to_cart_order  reordered
0       13176  Bag of Organic Bananas         5                  1          1
1       13176  Bag of Organic Bananas        27                  1          1
2       13176  Bag of Organic Bananas        29                  3          1

In [0]:
#i thought I needed to group order_id but i got confused more when I did.
#Merge_ToGrab_Order_ID=pd.merge(merging_Product_ID,orders,how='inner',on='order_id')

In [0]:
count = merging_Product_ID['product_name'].value_counts() 
print(count)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

Replicate table 1

In [0]:
#let make a column called treatment and its data entry a or b.
table1=table1.reset_index()  # reset the index and start with zero.
table1    #now we have a column called index, and an index_0 which we need to identify the column with the names.

   level_0         index  treatmenta  treatmentb
0        0    John Smith         NaN           2
1        1      Jane Doe        16.0          11
2        2  Mary Johnson         3.0           1

In [0]:
tidy=table1.melt(id_vars='index',value_vars=['treatmenta','treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
#let rename the index, variable and value column to name treatment and results
tidy=tidy.rename(columns={
    'index':'name',
    'variable':'treatment',
    'value':'results'
})
#remove string treatment because it it repetivite and not nice looking
tidy.treatment = tidy.treatment.str.replace('treatment','')
tidy

           name treatment  results
0    John Smith         a      NaN
1      Jane Doe         a     16.0
2  Mary Johnson         a      3.0
3    John Smith         b      2.0
4      Jane Doe         b     11.0
5  Mary Johnson         b      1.0

***Table 2 ->tidy***

1.   Each variable forms a column
2.   each observation form a row
3. each type of observational unit forms a table
  a) in other words, results = treatment + name

In [0]:
#let have name, or create names for all columns and indexs so we have a reference.
table2=table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
tidy2=table2.melt(id_vars='index',value_vars=['John Smith','Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
tidy2=tidy2.rename(columns={
    'index':'treatment',
    'variable':'name',
    'value':'results'
})
tidy2.treatment = tidy2.treatment.str.replace('treatment','')

tidy2

  treatment          name  results
0         a    John Smith      NaN
1         b    John Smith      2.0
2         a      Jane Doe     16.0
3         b      Jane Doe     11.0
4         a  Mary Johnson      3.0
5         b  Mary Johnson      1.0

In [0]:
#inverse the tidy2 table 
tidy2.pivot_table(index='treatment',columns='name',values='results')

name       Jane Doe  John Smith  Mary Johnson
treatment
a              16.0         NaN           3.0
b              11.0         2.0           1.0

***SNS Flight data set***


1.   row will be years
2.   column will be months

In [0]:
flights = sns.load_dataset('flights')
flights.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
flights.pivot_table('passengers',index='year',columns='month')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [11]:
##### YOUR CODE HERE #####
products.head(5)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [12]:
orders.head(5)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [13]:
order_products.head(5)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
#What columns I want from the files?
products_columns=['product_name','product_id']
order_products_id = ['order_id','product_id']
orders_columns = ['order_hour_of_day','order_id']
merge3 = (products[products_columns].merge(order_products[order_products_id]).merge(orders[orders_columns]))

In [23]:
column_product = ['product_name','order_hour_of_day']
condition = (merge3['order_hour_of_day'] >= 12)
#look inside merge3 file and pull all product name that has the order_hour_of_day entry row between 12 pm to 11.59pm
condition = merge3.loc[condition,column_product]
asdf= condition.groupby('product_name').mean().sort_values('order_hour_of_day',ascending=False)
asdf.head(55)
#condition2=condition['product_name'].value_counts()
#condition2.head(50)
#there is a small condition of product_name > 2900

                                                    order_hour_of_day
product_name
Amaretto Almond Crunch Ice Cream                            23.000000
Jalapeño Seasoned Tuna                                      23.000000
Cold & Sinus Nasal Spray                                    23.000000
Heavenly Villagio Marzano Tomatoes                          23.000000
Ocean Sea Salt Pumpkin Seeds                                23.000000
Cheese Slicer                                               23.000000
Lindor Peppermint White Chocolate Truffles                  23.000000
Sound Sleep Vegetarian Liquid Phyto-Caps                    23.000000
Lamb Breast Riblets                                         23.000000
Nutrish Naturally Delish Chicken Paw Pie Wet Do...          23.000000
Classic Frankfurters                                        23.000000
LittleSnug sz                                               23.000000
Peach Guava Coconut Water                                   23.000000
Organic Jasmine Pearl Green Tea Box                         23.000000
Imported Italian Solid Light Tuna In Pure Olive...          22.500000
Maple Tree Water                                            22.500000
Organic Veggie Italian Sausage                              22.000000
Sugar Leaf  Stevia and Raw Cane Sugar                       22.000000
Duck & Veal Demi Glace                                      22.000000
Hot Cocoa Mix, Rich Chocolate Flavor, No Sugar ...          22.000000
Relight Sparkle Candles                                     22.000000
Berry Sprouted Blend Cereal                                 22.000000
Colloidal Oatmeal Lavender Bath and Body Wash               22.000000
Granola Cups Peanut Butter Chocolate                        22.000000
Organic SprouTofu Hickory BBQ Smoked Tofu                   22.000000
Organic Pummelo                                             22.000000
Simply Homemade Walnut Banana Bread Mix                     22.000000
Cucumbers Color Protection Conditioner                      22.000000
Non-Dairy Sea Salt Caramel Gelato                           22.000000
Cornbread Bites                                             22.000000
Organic French Vanilla Protein Shake                        22.000000
Drinkable Yogurt, Mango                                     22.000000
Bittersweet Sea Salt Chocolate Bar                          22.000000
Scotch Kids 5\" Scissors, Blunted, Red                      21.500000
Organic Chili Cayenne                                       21.500000
Whisker Lickin's Crunchy Tuna Flavor Cat Treats             21.500000
Crystalized Ginger                                          21.500000
White Cone Style Coffee Filters Size 2                      21.500000
Whole Grain Matzo Meal                                      21.500000
New England Style Stuffed Scallops                          21.333333
Strawberry from Concentrate Nectar                          21.250000
Chocolate Malt Cup                                          21.000000
Fat Free Half And Half                                      21.000000
Fat Free Sherbert Orange                                    21.000000
Fresh From The Oven Whole Grain Seeded Hot Dog ...          21.000000
Espresso Iced Coffee                                        21.000000
Coconut Cardamom Almond Butter                              21.000000
Tomatoes, Crushed                                           21.000000
Natural Premium Coconut Water & Pineapple Juice...          21.000000
Cold Remedy Daytime & Nightime Quickmelts                   21.000000
Stage 2 Beet Pear Pomegranate Baby Food                     21.000000
3F Mixed Carrots Corn & Butternut Squash with L...          21.000000
Bursts Grape Soft Drink                                     21.000000
Grapefruit Rejuvenating Body Wash                           21.000000
Browning And Seasoning Sauce                                21.000000

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####